<?php
/**
 * Ukranian language file
 *
 * @package MajorDoMo
 * @author Serge Dzheigalo <jey@tut.by> http://smartliving.ru/
 * @version 1.0
 */


$dictionary = array (

    
    /* start array for convert number to string */
    
	'NUMBER_TO_STRING_1TEN' => array( array('','один','два','три','чотири','п`ять','шість','сім', 'вісім','дев`ять'), array('','одна','дві','три','чотири','п`ять','шість','сім', 'вісім','дев`ять')),
	'NUMBER_TO_STRING_2TEN' => array('десять','одиннадцять','дванадцять','тринадцять','чотирнадцять' ,'п`ятнадцять','шістнадцять','сімнадцять','вісімнадцять','дев`ятнадцять'),
	'NUMBER_TO_STRING_TENS' => array(2=>'двадцять','тридцять','сорок','п`ятьдесят','шістдесят','сімдесят' ,'вісімдесят','дев`яносто'),
	'NUMBER_TO_STRING_HUNDRED' => array('','сто','двісті','триста','чоториста','п`ятсот','шістьсот', 'сімсот','вісімсот','дев`ятсот'),
	'NUMBER_TO_STRING_UNIT' => array(array('десята' ,'десятих' , 1), array(' ' ,' ціла'   ,'цілих ' ,0),array('тисяча'  ,'тисячі'  ,'тисяч'     ,1), array('мільйон' ,'мільйона','мільйонів' ,0), array('мілльярд','мільярда','мільярдів',0)),
	'NUMBER_TO_STRING_NULL' => 'нуль',
	
    /* end array for convert number to string  */
        /* start array for convert date to string */
    
	'DATE_TO_STRING_THOUSANDS' => array(1 => 'одна тисяча', 2 => 'дві тисячі',),
	'DATE_TO_STRING_HUNDREDS' => array(0 => '', 9 => 'дев`ятьсот',),
	'DATE_TO_STRING_DAYS' => array(1 => 'перше',2 => 'друге',3 => 'третє',4 => 'четверте',5 => 'п`яте',6 => 'шостое',7 => 'сьоме',8 => 'восьме',9 => 'дев`яте',10 => 'десяте',11 => 'одиннадцяте',12 => 'двенадцяте',13 => 'тринадцяте',14 => 'чотирнадцяте',15 => 'п`ятнадцяте',16 => 'шістнадцяте',17 => 'сімнадцяте',18 => 'вісямнадцяте',19 => 'дев`ятнадцяте',20 => 'двадцяте',30 => 'тридцяте',40 => 'сорокове',),
	'NUMBER_TO_STRING_MONTH' => array(0 => 'нулября',1 => 'січня',2 => 'лютого',3 => 'березня',4 => 'квітня',5 => 'травня',6 => 'червня',7 => 'липня',8 => 'серпня',9 => 'вересня',10 => 'жовтня',11 => 'листопада',12 => 'грудня',),
	
    /* end array for convert date to string  */

);

foreach ($dictionary as $k => $v) {
    if (!defined('LANG_' . $k)) {
        define('LANG_' . $k, $v);
    }
}
